W11D3/benchbnb/app/controllers/application_controller.rb

  def current_user
    @current_user || User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "pjZx1UHZ45BQjr7bl0d-8w"], ["LIMIT", 1]]