W7D3/GoalApp/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "bob"], ["password_digest", "$2a$12$bnU0.tpptx8DQKyrNJ0Raeyh36FzlhCY7Gbm5/YsnmYxD0Khzeo5y"], ["session_token", "cmnUY4Dsydi3aSDTT9SAVQ"]]
---
  def create
    user = User.new(user_params)
    if user.save